<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"f0a0db7d5132558deb0afdcc4e6fcc740924369c90035c2e02dfe6d9c0eb4ab6","plan_job_ref":"Job Terraform Plan #6 at https://github.com/thetheilred/test-eks/actions/runs/13098599761","plan_hash":"3940acb776bcb13f9182542e7a847c216c2e4a00638b701a5b36234136cf0974","plan_text_format":"diff-trunc","version":"1.46.1","plan_out_hash":"2e3ce576e4ca23e2623dad3cab9f22676b751299499ed1819964703c8eafd482"} -->
Terraform plan in __terraform/eks__
<details>
<summary>Plan: 72 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # module.eks.data.aws_caller_identity.current[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
+       account_id = (known after apply)
+       arn        = (known after apply)
+       id         = (known after apply)
+       user_id    = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["coredns"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
+       addon_name         = "coredns"
+       id                 = (known after apply)
+       kubernetes_version = "1.31"
+       version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["eks-pod-identity-agent"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
+       addon_name         = "eks-pod-identity-agent"
+       id                 = (known after apply)
+       kubernetes_version = "1.31"
+       version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["kube-proxy"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
+       addon_name         = "kube-proxy"
+       id                 = (known after apply)
+       kubernetes_version = "1.31"
+       version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["vpc-cni"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
+       addon_name         = "vpc-cni"
+       id                 = (known after apply)
+       kubernetes_version = "1.31"
+       version            = (known after apply)
    }

  # module.eks.data.aws_iam_policy_document.assume_role_policy[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "assume_role_policy" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions = [
+               "sts:AssumeRole",
+               "sts:TagSession",
            ]
+           sid     = "EKSClusterAssumeRole"

+           principals {
+               identifiers = [
+                   "eks.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # module.eks.data.aws_iam_policy_document.custom[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "custom" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "ec2:CreateFleet",
+               "ec2:CreateLaunchTemplate",
+               "ec2:RunInstances",
            ]
+           resources = [
+               "*",
            ]
+           sid       = "Compute"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "${aws:PrincipalTag/eks:eks-cluster-name}",
                ]
+               variable = "aws:RequestTag/eks:eks-cluster-name"
            }
+           condition {
+               test     = "StringLike"
+               values   = [
+                   "*",
                ]
+               variable = "aws:RequestTag/eks:kubernetes-node-class-name"
            }
+           condition {
+               test     = "StringLike"
+               values   = [
+                   "*",
                ]
+               variable = "aws:RequestTag/eks:kubernetes-node-pool-name"
            }
        }
+       statement {
+           actions   = [
+               "ec2:CreateSnapshot",
+               "ec2:CreateVolume",
            ]
+           resources = [
+               (known after apply),
+               (known after apply),
            ]
+           sid       = "Storage"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "${aws:PrincipalTag/eks:eks-cluster-name}",
                ]
+               variable = "aws:RequestTag/eks:eks-cluster-name"
            }
        }
+       statement {
+           actions   = [
+               "ec2:CreateNetworkInterface",
            ]
+           resources = [
+               "*",
            ]
+           sid       = "Networking"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "${aws:PrincipalTag/eks:eks-cluster-name}",
                ]
+               variable = "aws:RequestTag/eks:eks-cluster-name"
            }
+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "*",
                ]
+               variable = "aws:RequestTag/eks:kubernetes-cni-node-name"
            }
        }
+       statement {
+           actions   = [
+               "ec2:CreateSecurityGroup",
+               "elasticloadbalancing:CreateListener",
+               "elasticloadbalancing:CreateLoadBalancer",
+               "elasticloadbalancing:CreateRule",
+               "elasticloadbalancing:CreateTargetGroup",
            ]
+           resources = [
+               "*",
            ]
+           sid       = "LoadBalancer"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "${aws:PrincipalTag/eks:eks-cluster-name}",
                ]
+               variable = "aws:RequestTag/eks:eks-cluster-name"
            }
        }
+       statement {
+           actions   = [
+               "shield:CreateProtection",
            ]
+           resources = [
+               "*",
            ]
+           sid       = "ShieldProtection"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "${aws:PrincipalTag/eks:eks-cluster-name}",
                ]
+               variable = "aws:RequestTag/eks:eks-cluster-name"
            }
        }
+       statement {
+           actions   = [
+               "shield:TagResource",
            ]
+           resources = [
+               (known after apply),
            ]
+           sid       = "ShieldTagResource"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "${aws:PrincipalTag/eks:eks-cluster-name}",
                ]
+               variable = "aws:RequestTag/eks:eks-cluster-name"
            }
        }
    }

  # module.eks.data.aws_iam_session_context.current[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_session_context" "current" {
+       arn          = (known after apply)
+       id           = (known after apply)
+       issuer_arn   = (known after apply)
+       issuer_id    = (known after apply)
+       issuer_name  = (known after apply)
+       session_name = (known after apply)
    }

  # module.eks.data.aws_partition.current[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
+       dns_suffix         = (known after apply)
+       id                 = (known after apply)
+       partition          = (known after apply)
+       reverse_dns_prefix = (known after apply)
    }

  # module.eks.data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this" {
+       certificates = (known after apply)
+       id           = (known after apply)
+       url          = (known after apply)
    }

  # module.eks.aws_cloudwatch_log_group.this[0] will be created
+   resource "aws_cloudwatch_log_group" "this" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       log_group_class   = (known after apply)
+       name              = "/aws/eks/eks-dev-cluster/cluster"
+       name_prefix       = (known after apply)
+       retention_in_days = 90
+       skip_destroy      = false
+       tags              = {
+           "Environment" = "dev"
+           "Name"        = "/aws/eks/eks-dev-cluster/cluster"
+           "Terraform"   = "true"
        }
+       tags_all          = {
+           "Environment" = "dev"
+           "Name"        = "/aws/eks/eks-dev-cluster/cluster"
+           "Terraform"   = "true"
        }
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["Environment"] will be created
+   resource "aws_ec2_tag" "cluster_primary_security_group" {
+       id          = (known after apply)
+       key         = "Environment"
+       resource_id = (known after apply)
+       value       = "dev"
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["Terraform"] will be created
+   resource "aws_ec2_tag" "cluster_primary_security_group" {
+       id          = (known after apply)
+       key         = "Terraform"
+       resource_id = (known after apply)
+       value       = "true"
    }

  # module.eks.aws_eks_access_entry.this["cluster_creator"] will be created
+   resource "aws_eks_access_entry" "this" {
+       access_entry_arn  = (known after apply)
+       cluster_name      = (known after apply)
+       created_at        = (known after apply)
+       id                = (known after apply)
+       kubernetes_groups = (known after apply)
+       modified_at       = (known after apply)
+       principal_arn     = (known after apply)
+       tags              = {
+           "Environment" = "dev"
+           "Terraform"   = "true"
        }
+       tags_all          = {
+           "Environment" = "dev"
+           "Terraform"   = "true"
        }
+       type              = "STANDARD"
+       user_name         = (known after apply)
    }

  # module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"] will be created
+   resource "aws_eks_access_policy_association" "this" {
+       associated_at = (known after apply)
+       cluster_name  = (known after apply)
+       id            = (known after apply)
+       modified_at   = (known after apply)
+       policy_arn    = (known after apply)
+       principal_arn = (known after apply)

+       access_scope {
+           type = "cluster"
        }
    }

  # module.eks.aws_eks_addon.this["coredns"] will be created
+   resource "aws_eks_addon" "this" {
+       addon_name                  = "coredns"
+       addon_version               = (known after apply)
+       arn                         = (known after apply)
+       cluster_name                = (known after apply)
+       configuration_values        = (known after apply)
+       created_at                  = (known after apply)
+       id                          = (known after apply)
+       modified_at                 = (known after apply)
+       preserve                    = true
+       resolve_conflicts_on_create = "OVERWRITE"
+       resolve_conflicts_on_update = "OVERWRITE"
+       tags                        = {
+           "Environment" = "dev"
+           "Terraform"   = "true"
        }
+       tags_all                    = {
+           "Environment" = "dev"
+           "Terraform"   = "true"
        }

+       timeouts {}
    }

  # module.eks.aws_eks_addon.this["eks-pod-identity-agent"] will be created
+   resource "aws_eks_addon" "this" {
+       addon_name                  = "eks-pod-identity-agent"
+       addon_version               = (known after apply)
+       arn                         = (known after apply)
+       cluster_name                = (known after apply)
+       configuration_values        = (known after apply)
+       created_at                  = (known after apply)
+       id                          = (known after apply)
+       modified_at                 = (known after apply)
+       preserve                    = true
+       resolve_conflicts_on_create = "OVERWRITE"
+       resolve_conflicts_on_update = "OVERWRITE"
+       tags                        = {
+           "Environment" = "dev"
+           "Terraform"   = "true"
        }
+       tags_all                    = {
+           "Environment" = "dev"
+           "Terraform"   = "true"
        }

+       timeouts {}
    }

  # module.eks.aws_eks_addon.this["kube-proxy"] will be created
+   resource "aws_eks_addon" "this" {
+       addon_name                  = "kube-proxy"
+       addon_version               = (known after apply)
+       arn                         = (known after apply)
+       cluster_name                = (known after apply)
+       configuration_values        = (known after apply)
+       created_at                  = (known after apply)
+       id                          = (known after apply)
+       modified_at                 = (known after apply)
+       preserve                    = true
+       resolve_conflicts_on_create = "OVERWRITE"
+       resolve_conflicts_on_update = "OVERWRITE"
+       tags                        = {
+           "Environment" = "dev"
+           "Terraform"   = "true"
        }
+       tags_all                    = {
+           "Environment" = "dev"
+           "Terraform"   = "true"
        }

+       timeouts {}
    }

  # module.eks.aws_eks_addon.this["vpc-cni"] will be created
+   resource "aws_eks_addon" "this" {
+       addon_name                  = "vpc-cni"
+       addon_version               = (known after apply)
+       arn                         = (known after apply)
+       cluster_name                = (known after apply)
+       configuration_values        = (known after apply)
+       created_at                  = (known after apply)
+       id                          = (known after apply)
+       modified_at                 = (known after apply)
+       preserve                    = true
+       resolve_conflicts_on_create = "OVERWRITE"
+       resolve_conflicts_on_update = "OVERWRITE"
+       tags                        = {
+           "Environment" = "dev"
+           "Terraform"   = "true"
        }
+       tags_all                    = {
+           "Environment" = "dev"
+           "Terraform"   = "true"
        }

+       timeouts {}
    }

  # module.eks.aws_eks_cluster.this[0] will be created
+   resource "aws_eks_cluster" "this" {
+       arn                           = (known after apply)
+       bootstrap_self_managed_addons = true
+       certificate_authority         = (known after apply)
+       cluster_id                    = (known after apply)
+       created_at                    = (known after apply)
+       enabled_cluster_log_types     = [
+           "api",
+           "audit",
+           "authenticator",
        ]
+       endpoint                      = (known after apply)
+       id                            = (known after apply)
+       identity                      = (known after apply)
+       name                          = "eks-dev-cluster"
+       platform_version              = (known after apply)
+       role_arn                      = (known after apply)
+       status                        = (known after apply)
+       tags                          = {
+           "Environment"           = "dev"
+           "Terraform"             = "true"
+           "terraform-aws-modules" = "eks"
        }
+       tags_all                      = {
+           "Environment"           = "dev"
+           "Terraform"             = "true"
+           "terraform-aws-modules" = "eks"
        }
+       version                       = "1.31"

+       access_config {
+           authentication_mode                         = "API_AND_CONFIG_MAP"
+           bootstrap_cluster_creator_admin_permissions = false
        }

+       encryption_config {
+           resources = [
+               "secrets",
            ]

+           provider {
+               key_arn = (known after apply)
            }
        }

+       kubernetes_network_config {
+           ip_family         = "ipv4"
+           service_ipv4_cidr = (known after apply)
+           service_ipv6_cidr = (known after apply)

+           elastic_load_balancing (known after apply)
        }

+       timeouts {}

+       upgrade_policy (known after apply)

+       vpc_config {
+           cluster_security_group_id = (known after apply)
+           endpoint_private_access   = true
+           endpoint_public_access    = true
+           public_access_cidrs       = [
+               "0.0.0.0/0",
            ]
+           security_group_ids        = (known after apply)
+           subnet_ids                = (known after apply)
+           vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be created
+   resource "aws_iam_openid_connect_provider" "oidc_provider" {
+       arn             = (known after apply)
+       client_id_list  = [
+           "sts.amazonaws.com",
        ]
+       id              = (known after apply)
+       tags            = {
+           "Environment" = "dev"
+           "Name"        = "eks-dev-cluster-eks-irsa"
+           "Terraform"   = "true"
        }
+       tags_all        = {
+           "Environment" = "dev"
+           "Name"        = "eks-dev-cluster-eks-irsa"
+           "Terraform"   = "true"
        }
+       thumbprint_list = (known after apply)
+       url             = (known after apply)
    }

  # module.eks.aws_iam_policy.cluster_encryption[0] will be created
+   resource "aws_iam_policy" "cluster_encryption" {
+       arn              = (known after apply)
+       attachment_count = (known after apply)
+       description      = "Cluster encryption policy to allow cluster role to utilize CMK provided"
+       id               = (known after apply)
+       name             = (known after apply)
+       name_prefix      = "eks-dev-cluster-cluster-ClusterEncryption"
+       path             = "/"
+       policy           = (known after apply)
+       policy_id        = (known after apply)
+       tags             = {
+           "Environment" = "dev"
+           "Terraform"   = "true"
        }
+       tags_all         = {
+           "Environment" = "dev"
+           "Terraform"   = "true"
        }
    }

  # module.eks.aws_iam_policy.custom[0] will be created
+   resource "aws_iam_policy" "custom" {
+       arn              = (known after apply)
+       attachment_count = (known after apply)
+       id               = (known after apply)
+       name             = (known after apply)
+       name_prefix      = "eks-dev-cluster-cluster-"
+       path             = "/"
+       policy           = (known after apply)
+       policy_id        = (known after apply)
+       tags             = {
+           "Environment" = "dev"
+           "Terraform"   = "true"
        }
+       tags_all         = {
+           "Environment" = "dev"
+           "Terraform"   = "true"
        }
    }

  # module.eks.aws_iam_role.this[0] will be created
+   resource "aws_iam_role" "this" {
+       arn                   = (known after apply)
+       assume_role_policy    = (known after apply)
+       create_date           = (known after apply)
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = "eks-dev-cluster-cluster-"
+       path                  = "/"
+       tags                  = {
+           "Environment" = "dev"
+           "Terraform"   = "true"
        }
+       tags_all              = {
+           "Environment" = "dev"
+           "Terraform"   = "true"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_encryption[0] will be created
+   resource "aws_iam_role_policy_attachment" "cluster_encryption" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.custom[0] will be created
+   resource "aws_iam_role_policy_attachment" "custom" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"] will be created
+   resource "aws_iam_role_policy_attachment" "this" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"] will be created
+   resource "aws_iam_role_policy_attachment" "this" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = (known after apply)
    }

  # module.eks.aws_security_group.cluster[0] will be created
+   resource "aws_security_group" "cluster" {
+       arn                    = (known after apply)
+       description            = "EKS cluster security group"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = "eks-dev-cluster-cluster-"
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Environment" = "dev"
+           "Name"        = "eks-dev-cluster-cluster"
+           "Terraform"   = "true"
        }
+       tags_all               = {
+           "Environment" = "dev"
+           "Name"        = "eks-dev-cluster-cluster"
+           "Terraform"   = "true"
        }
+       vpc_id                 = (known after apply)
    }

  # module.eks.aws_security_group.node[0] will be created
+   resource "aws_security_group" "node" {
+       arn                    = (known after apply)
+       description            = "EKS node shared security group"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = "eks-dev-cluster-node-"
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Environment"                           = "dev"
+           "Name"                                  = "eks-dev-cluster-node"
+           "Terraform"                             = "true"
+           "kubernetes.io/cluster/eks-dev-cluster" = "owned"
        }
+       tags_all               = {
+           "Environment"                           = "dev"
+           "Name"                                  = "eks-dev-cluster-node"
+           "Terraform"                             = "true"
+           "kubernetes.io/cluster/eks-dev-cluster" = "owned"
        }
+       vpc_id                 = (known after apply)
    }

  # module.eks.aws_security_group_rule.cluster["ingress_nodes_443"] will be created
+   resource "aws_security_group_rule" "cluster" {
+       description              = "Node groups to cluster API"
+       from_port                = 443
+       id                       = (known after apply)
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 443
+       type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["egress_all"] will be created
+   resource "aws_security_group_rule" "node" {
+       cidr_blocks              = [
+           "0.0.0.0/0",
        ]
+       description              = "Allow all egress"
+       from_port                = 0
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "-1"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 0
+       type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_443"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Cluster API to node groups"
+       from_port                = 443
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 443
+       type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Cluster API to node 4443/tcp webhook"
+       from_port                = 4443
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 4443
+       type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Cluster API to node 6443/tcp webhook"
+       from_port                = 6443
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 6443
+       type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Cluster API to node 8443/tcp webhook"
+       from_port                = 8443
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 8443
+       type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Cluster API to node 9443/tcp webhook"
+       from_port                = 9443
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 9443
+       type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Cluster API to node kubelets"
+       from_port                = 10250
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 10250
+       type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Node to node ingress on ephemeral ports"
+       from_port                = 1025
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = true
+       source_security_group_id = (known after apply)
+       to_port                  = 65535
+       type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Node to node CoreDNS"
+       from_port                = 53
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = true
+       source_security_group_id = (known after apply)
+       to_port                  = 53
+       type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Node to node CoreDNS UDP"
+       from_port                = 53
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "udp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = true
+       source_security_group_id = (known after apply)
+       to_port                  = 53
+       type                     = "ingress"
    }

  # module.eks.time_sleep.this[0] will be created
+   resource "time_sleep" "this" {
+       create_duration = "30s"
+       id              = (known after apply)
+       triggers        = {
+           "cluster_certificate_authority_data" = (known after apply)
+           "cluster_endpoint"                   = (known after apply)
+           "cluster_name"                       = (known after apply)
+           "cluster_service_cidr"               = (known after apply)
+           "cluster_version"                    = "1.31"
        }
    }

  # module.vpc.aws_default_network_acl.this[0] will be created
+   resource "aws_default_network_acl" "this" {
+       arn                    = (known after apply)
+       default_network_acl_id = (known after apply)
+       id                     = (known after apply)
+       owner_id               = (known after apply)
+       tags                   = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-default"
+           "Terraform"   = "true"
        }
+       tags_all               = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-default"
+           "Terraform"   = "true"
        }
+       vpc_id                 = (known after apply)

+       egress {
+           action          = "allow"
+           from_port       = 0
+           ipv6_cidr_block = "::/0"
+           protocol        = "-1"
+           rule_no         = 101
+           to_port         = 0
#            (1 unchanged attribute hidden)
        }
+       egress {
+           action          = "allow"
+           cidr_block      = "0.0.0.0/0"
+           from_port       = 0
+           protocol        = "-1"
+           rule_no         = 100
+           to_port         = 0
#            (1 unchanged attribute hidden)
        }

+       ingress {
+           action          = "allow"
+           from_port       = 0
+           ipv6_cidr_block = "::/0"
+           protocol        = "-1"
+           rule_no         = 101
+           to_port         = 0
#            (1 unchanged attribute hidden)
        }
+       ingress {
+           action          = "allow"
+           cidr_block      = "0.0.0.0/0"
+           from_port       = 0
+           protocol        = "-1"
+           rule_no         = 100
+           to_port         = 0
#            (1 unchanged attribute hidden)
        }
    }

  # module.vpc.aws_default_route_table.default[0] will be created
+   resource "aws_default_route_table" "default" {
+       arn                    = (known after apply)
+       default_route_table_id = (known after apply)
+       id                     = (known after apply)
+       owner_id               = (known after apply)
+       route                  = (known after apply)
+       tags                   = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-default"
+           "Terraform"   = "true"
        }
+       tags_all               = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-default"
+           "Terraform"   = "true"
        }
+       vpc_id                 = (known after apply)

+       timeouts {
+           create = "5m"
+           update = "5m"
        }
    }

  # module.vpc.aws_default_security_group.this[0] will be created
+   resource "aws_default_security_group" "this" {
+       arn                    = (known after apply)
+       description            = (known after apply)
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-default"
+           "Terraform"   = "true"
        }
+       tags_all               = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-default"
+           "Terraform"   = "true"
        }
+       vpc_id                 = (known after apply)
    }

  # module.vpc.aws_eip.nat[0] will be created
+   resource "aws_eip" "nat" {
+       allocation_id        = (known after apply)
+       arn                  = (known after apply)
+       association_id       = (known after apply)
+       carrier_ip           = (known after apply)
+       customer_owned_ip    = (known after apply)
+       domain               = "vpc"
+       id                   = (known after apply)
+       instance             = (known after apply)
+       ipam_pool_id         = (known after apply)
+       network_border_group = (known after apply)
+       network_interface    = (known after apply)
+       private_dns          = (known after apply)
+       private_ip           = (known after apply)
+       ptr_record           = (known after apply)
+       public_dns           = (known after apply)
+       public_ip            = (known after apply)
+       public_ipv4_pool     = (known after apply)
+       tags                 = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-us-east-1a"
+           "Terraform"   = "true"
        }
+       tags_all             = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-us-east-1a"
+           "Terraform"   = "true"
        }
+       vpc                  = (known after apply)
    }

  # module.vpc.aws_eip.nat[1] will be created
+   resource "aws_eip" "nat" {
+       allocation_id        = (known after apply)
+       arn                  = (known after apply)
+       association_id       = (known after apply)
+       carrier_ip           = (known after apply)
+       customer_owned_ip    = (known after apply)
+       domain               = "vpc"
+       id                   = (known after apply)
+       instance             = (known after apply)
+       ipam_pool_id         = (known after apply)
+       network_border_group = (known after apply)
+       network_interface    = (known after apply)
+       private_dns          = (known after apply)
+       private_ip           = (known after apply)
+       ptr_record           = (known after apply)
+       public_dns           = (known after apply)
+       public_ip            = (known after apply)
+       public_ipv4_pool     = (known after apply)
+       tags                 = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-us-east-1b"
+           "Terraform"   = "true"
        }
+       tags_all             = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-us-east-1b"
+           "Terraform"   = "true"
        }
+       vpc                  = (known after apply)
    }

  # module.vpc.aws_eip.nat[2] will be created
+   resource "aws_eip" "nat" {
+       allocation_id        = (known after apply)
+       arn                  = (known after apply)
+       association_id       = (known after apply)
+       carrier_ip           = (known after apply)
+       customer_owned_ip    = (known after apply)
+       domain               = "vpc"
+       id                   = (known after apply)
+       instance             = (known after apply)
+       ipam_pool_id         = (known after apply)
+       network_border_group = (known after apply)
+       network_interface    = (known after apply)
+       private_dns          = (known after apply)
+       private_ip           = (known after apply)
+       ptr_record           = (known after apply)
+       public_dns           = (known after apply)
+       public_ip            = (known after apply)
+       public_ipv4_pool     = (known after apply)
+       tags                 = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-us-east-1c"
+           "Terraform"   = "true"
        }
+       tags_all             = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-us-east-1c"
+           "Terraform"   = "true"
        }
+       vpc                  = (known after apply)
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
+   resource "aws_internet_gateway" "this" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       owner_id = (known after apply)
+       tags     = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc"
+           "Terraform"   = "true"
        }
+       tags_all = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc"
+           "Terraform"   = "true"
        }
+       vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
+   resource "aws_nat_gateway" "this" {
+       allocation_id                      = (known after apply)
+       association_id                     = (known after apply)
+       connectivity_type                  = "public"
+       id                                 = (known after apply)
+       network_interface_id               = (known after apply)
+       private_ip                         = (known after apply)
+       public_ip                          = (known after apply)
+       secondary_private_ip_address_count = (known after apply)
+       secondary_private_ip_addresses     = (known after apply)
+       subnet_id                          = (known after apply)
+       tags                               = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-us-east-1a"
+           "Terraform"   = "true"
        }
+       tags_all                           = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-us-east-1a"
+           "Terraform"   = "true"
        }
    }

  # module.vpc.aws_nat_gateway.this[1] will be created
+   resource "aws_nat_gateway" "this" {
+       allocation_id                      = (known after apply)
+       association_id                     = (known after apply)
+       connectivity_type                  = "public"
+       id                                 = (known after apply)
+       network_interface_id               = (known after apply)
+       private_ip                         = (known after apply)
+       public_ip                          = (known after apply)
+       secondary_private_ip_address_count = (known after apply)
+       secondary_private_ip_addresses     = (known after apply)
+       subnet_id                          = (known after apply)
+       tags                               = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-us-east-1b"
+           "Terraform"   = "true"
        }
+       tags_all                           = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-us-east-1b"
+           "Terraform"   = "true"
        }
    }

  # module.vpc.aws_nat_gateway.this[2] will be created
+   resource "aws_nat_gateway" "this" {
+       allocation_id                      = (known after apply)
+       association_id                     = (known after apply)
+       connectivity_type                  = "public"
+       id                                 = (known after apply)
+       network_interface_id               = (known after apply)
+       private_ip                         = (known after apply)
+       public_ip                          = (known after apply)
+       secondary_private_ip_address_count = (known after apply)
+       secondary_private_ip_addresses     = (known after apply)
+       subnet_id                          = (known after apply)
+       tags                               = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-us-east-1c"
+           "Terraform"   = "true"
        }
+       tags_all                           = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-us-east-1c"
+           "Terraform"   = "true"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
+   resource "aws_route" "private_nat_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       nat_gateway_id         = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[1] will be created
+   resource "aws_route" "private_nat_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       nat_gateway_id         = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[2] will be created
+   resource "aws_route" "private_nat_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       nat_gateway_id         = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
+   resource "aws_route" "public_internet_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       gateway_id             = (known after apply)
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
+   resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-private-us-east-1a"
+           "Terraform"   = "true"
        }
+       tags_all         = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-private-us-east-1a"
+           "Terraform"   = "true"
        }
+       vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[1] will be created
+   resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-private-us-east-1b"
+           "Terraform"   = "true"
        }
+       tags_all         = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-private-us-east-1b"
+           "Terraform"   = "true"
        }
+       vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[2] will be created
+   resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-private-us-east-1c"
+           "Terraform"   = "true"
        }
+       tags_all         = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-private-us-east-1c"
+           "Terraform"   = "true"
        }
+       vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
+   resource "aws_route_table" "public" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-public"
+           "Terraform"   = "true"
        }
+       tags_all         = {
+           "Environment" = "dev"
+           "Name"        = "eks-vpc-public"
+           "Terraform"   = "true"
        }
+       vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

Plan is too large to fit in a PR comment. See the full plan in the workflow log.
```
</details>

:memo: Plan generated in [Terraform Plan #6](https://github.com/thetheilred/test-eks/actions/runs/13098599761)